#+title: Log
* rank02
** level0
*** first_word
:LOGBOOK:
CLOCK: [2026-02-19 Thu 09:44]--[2026-02-19 Thu 09:57] =>  0:13
:END:
**** Mistakes
- forget to increment s
- wrong operator for comparison
  #+begin_src c
	while (*s && (*s != ' ' || *s != '\t'))
  #+end_src
*** fizzbuzz
*** ft_putstr
*** ft_strcpy
*** ft_strlen
:LOGBOOK:
CLOCK: [2026-02-19 Thu 09:58]--[2026-02-19 Thu 10:04] =>  0:06
:END:
**** Mistakes
*** ft_swap
*** repeat_alpha
:LOGBOOK:
CLOCK: [2026-02-17 Tue 22:32]--[2026-02-17 Tue 22:58] =>  0:26
CLOCK: [2026-02-17 Tue 21:27]--[2026-02-17 Tue 22:01] =>  0:34
:END:
**** Mistakes
- Passing wrong argument to write
  #+begin_src c
		write(1, *s,1); // wrong
		write(1, s,1); // right
  #+end_src
- Didn't calculate the index using the correct formula
#+begin_src c
			if (*s >= 'a')
				i = 'z' - *s;
			else
				i = 'Z' - *s;

			if (*s >= 'a')
				i = 'a' - *s;
			else
				i = 'a' - *s;

			if (*s >= 'a')
				i = *s - 'a'  ;
			else
				i = *s - 'A';
#+end_src
- Wrong comparison operator
#+begin_src c
		if ((('a'<= *s) && (*s >= 'z')) || (('A'<= *s) && (*s >= 'Z')))
#+end_src
*** rev_print
:LOGBOOK:
CLOCK: [2026-02-17 Tue 21:13]--[2026-02-17 Tue 21:22] =>  0:09
CLOCK: [2026-02-17 Tue 20:18]--[2026-02-17 Tue 20:41] =>  0:23
:END:
**** Mistakes
- Strlen function, didn't put in guard clause -> this cause segfault as reading of invalid memory
- Main program, attempt to write this, which didnt print out anything
  #+begin_src c
		write(1, &argv[1],1);
  #+end_src
- Didn't add in newline character after printing the characters
*** rot_13
:LOGBOOK:
CLOCK: [2026-02-19 Thu 13:30]--[2026-02-19 Thu 13:43] =>  0:13
CLOCK: [2026-02-19 Thu 10:05]--[2026-02-19 Thu 10:15] =>  0:10
:END:
**** Mistakes
*** rotone
*** search_and_replace
*** ulstr
:LOGBOOK:
CLOCK: [2026-02-18 Wed 12:02]--[2026-02-18 Wed 12:12] =>  0:10
:END:
**** Mistakes
** level1
*** alpha_mirror
*** camel_to_snake
-
*** do_op
-
*** ft_atoi
*** ft_strcmp
*** ft_strcspn
*** ft_strdup
*** ft_strrev
*** inter
:LOGBOOK:
CLOCK: [2026-02-24 Tue 15:40]--[2026-02-24 Tue 16:11] =>  0:31
CLOCK: [2026-02-24 Tue 14:54]--[2026-02-24 Tue 15:22] =>  0:28
:END:
**** Mistake
- Inner loop doesn't increment after printing out the char which cause n number of duplicates to be printed as the inner if statement only check string_1 and duplicate
  #+begin_src c
	while (argv[1][str_1])
	{
		str_2 = 0;
		while (argv[2][str_2])
		{
			if (argv[1][str_1] == argv[2][str_2])
			{
				dup_1 = 0;
				while (argv[1][dup_1] != argv[1][str_1])
					dup_1++;
				if (dup_1 == str_1)
					write(1, &argv[1][str_1], 1);
				else
					break;
			}
			str_2++;
		}
		str_1++;
	}
  #+end_src
*** is_power_of_2
*** last_word
*** max
-
*** print_bits
*** reverse_bits
*** snake_to_camel
*** swap_bits
*** union
-
*** wdmatch
-
** level2
*** add_prime_sum
*** epur_str
*** expand_str
*** ft_atoi_base
*** ft_list_size
*** ft_range
*** ft_rrange
*** hidenp
*** lcm
*** paramsum
*** pgcd
*** print_hex
*** rstr_capitalizer
*** str_capitalizer
*** tab_mult
** level3
*** flood_fill
*** fprime
*** ft_itoa
*** ft_list_foreach
*** ft_list_remove_if
*** ft_split
*** rev_wstr
*** rostring
*** sort_int_tab
*** sort_list
* rank03
** level1
*** broken_gnl
*** filter
*** scanf
** level2
*** n_queens
*** permutations
*** powerset
*** rip
*** tsp
* rank04
** level1
*** ft_popen
*** picoshell
*** sandbox
** level2
*** argo
*** vbc
* rank05
** level1
*** bigint
*** polyset
*** vect2
** level2
*** bsq
*** life
